# Робота з булевими значеннями (Booleans)
# Умова:
#
# Створіть дві змінні, is_sunny (чи сонячно) та is_warm (чи тепло), і присвойте їм булеві значення (True або False).
# Перевірте, чи можна йти гуляти (умова: сонячно і тепло). Виведіть результат.
# Перевірте, чи можна вдягнути футболку (умова: сонячно або тепло). Виведіть результат.

# 1. Створюємо булеві змінні
is_sunny = True
is_warm = False

# 2. Перевіряємо, чи можна йти гуляти
if is_sunny and is_warm:
    print('can go for a walk')

#  Перевіряємо, чи можна вдягнути футболку
if is_sunny or is_warm:
    print(f"Чи можна вдягнути футболку")


# Напишіть програму, яка приймає на вхід назву дня тижня (наприклад, "Понеділок", "Субота")
# і за допомогою конструкції match визначає, чи є цей день робочим, вихідним, чи невірною назвою.
# Визначає тип дня тижня (робочий/вихідний) за його назвою.
# Переводимо назву дня в нижній регістр для нечутливості до регістру
day = 'понеділок'
# day = input('ввведіть назву дня')

# Використовуємо match для визначення типу дня
match day:
    case "понеділок" | "вівторок" | "середа" | "четвер" | "п'ятниця":
        print(f"{day} - це робочий день.")
    case "субота" | "неділя":
        print(f"{day} - це вихідний день!")
    case _:  # _ - це "wildcard", відповідає будь-якому іншому значенню
        print(f"'{day}' - це невірна назва дня тижня.")
