# Створіть 6 змінних з будь-якими значенням
var_1 = 10
var_2 = 30.33
var_3 = 'hello'
var_4 = "okten"
var_5 = True
var_6 = False

# Робота з числами
# Умова:
#
# Створіть дві змінні, a та b, та присвойте їм будь-які числові значення (цілі або дробові).
# Обчисліть їх суму, різницю і тд.
# Виведіть результати кожної операції на екран з відповідними поясненнями.

# 1. Створюємо змінні
a = 15
b = 4

# 2. Обчислюємо операції
suma = a + b
riznytsya = a - b
mnojennya = a * b
chastka = a / b
chastka_tsila = a // b  # Цілочисельне ділення

# 3. Виводимо результати
print(f"Число a = {a}")
print(f"Число b = {b}")
print(f"Сума: {a} + {b} = {suma}")
print(f"Різниця: {a} - {b} = {riznytsya}")
print(f"Добуток: {a} * {b} = {mnojennya}")
print(f"Частка: {a} / {b} = {chastka}")
print(f"Цілочисельна частка: {a} // {b} = {chastka_tsila}")

# Завдання 2: Робота з рядками (Strings) ✍️
# Умова:
#
# Створіть змінну first_name та присвойте їй ваше ім'я.
# Створіть змінну last_name та присвойте їй ваше прізвище.
# Створіть змінну full_name, об'єднавши (конкатенувавши) ім'я та прізвище через пробіл.
# Виведіть full_name на екран.
# Виведіть довжину рядка full_name.
# Виведіть full_name у верхньому та нижньому регістрах.

# 1. Створюємо змінну для імені
first_name = "Тарас"

# 2. Створюємо змінну для прізвища
last_name = "Шевченко"

# 3. Об'єднуємо ім'я та прізвище
full_name = first_name + " " + last_name

# 4. Виводимо повне ім'я
print(f"Повне ім'я: {full_name}")


#  Змішані типи та введення даних 🧑‍💻
# Умова:
# ім'я  збережіть у змінну.
#  вік збережіть у змінну.
# Обчисліть, скільки років буде користувачу через 10 років.
# Виведіть повідомлення у форматі: "Привіт, [Ім'я]! Тобі зараз [Вік] років. Через 10 років тобі буде [Вік+10] років."
# 1. Запитуємо ім'я
user_name = 'vasya'

# 2. Запитуємо вік і перетворюємо його на число (int)
user_age = 18

# 3. Обчислюємо вік через 10 років
age_in_10_years = user_age + 10

# 4. Виводимо повідомлення
print(f"Привіт, {user_name}! Тобі зараз {user_age} років. Через 10 років тобі буде {age_in_10_years} років.")

