# Робота з булевими значеннями (Booleans)
# Створіть дві змінні, is_sunny (чи сонячно) та is_warm (чи тепло), і присвойте їм булеві значення (True або False).
# Перевірте, чи можна йти гуляти (умова: сонячно і тепло). Виведіть результат.
# Перевірте, чи можна вдягнути футболку (умова: сонячно або тепло). Виведіть результат.


is_sunny = False
is_warm = False
# print(is_sunny and is_warm)

if is_sunny and is_warm:
    print('you can go walk')

print(is_sunny or is_warm)
if is_sunny or is_warm:
    print('you can wear t shirt')

# Напишіть програму, яка приймає на вхід назву дня тижня (наприклад, "Понеділок", "Субота")
# і за допомогою конструкції match визначає, чи є цей день робочим, вихідним, чи невірною назвою.
# Визначає тип дня тижня (робочий/вихідний) за його назвою.

day = 'субота'
# day = input('введіть назву дня \n')

match day:
    case "понеділок" | "вівторок" | "середа" | "четверг" | "п'ятниця":
        print('робочий')
    case "субота" | "неділя":
        print('вихідний')
    case _:
        print('????')
