# Створіть словник з назвою fruit_stock.
# Додайте до нього три пари "ключ: значення":
# "apple": 10
# "banana": 15
# "orange": 8
# Виведіть на екран весь словник fruit_stock.
# Виведіть на екран кількість яблук, звернувшись до значення за ключем "apple".
# Додайте новий фрукт до словника: "груша" зі значенням 12.
# Змініть кількість banana: встановіть нове значення 20.
# Виведіть на екран оновлений словник fruit_stock.
fruit_stock = {
    "apple": 10,
    "banana": 15,
    "orange": 8
}
print(fruit_stock)

print(fruit_stock['apple'])
fruit_stock['pear'] = 12
print(fruit_stock)
fruit_stock['banana'] = 20
print(fruit_stock)

# Створення та доступ до елементів списку
#
# Створіть список з назвою shopping_list, який містить наступні рядки: "молоко", "хліб", "яйця", "сир".
# Виведіть на екран весь список.
# Виведіть на екран перший елемент списку (той, що має індекс 0)

shopping_list = ["молоко", "хліб", "яйця", "сир"]
print(shopping_list)
print(shopping_list[0])

# Створи список із 7 собак.
#
# Кожна собака — словник з трьома полями: "name" (кличка), "age" (вік), "breed" (порода).
#
# Виведи третю собаку зі списку та її кличку.

dogs = [
    {"name": "Рекс", "age": 5, "breed": "Лабрадор"},
    {"name": "Бім", "age": 3, "breed": "Хаскі"},
    {"name": "Тузик", "age": 4, "breed": "Вівчарка"},
    {"name": "Барні", "age": 2, "breed": "Мопс"},
    {"name": "Чарлі", "age": 6, "breed": "Бульдог"},
    {"name": "Лакі", "age": 1, "breed": "Коргі"},
    {"name": "Макс", "age": 7, "breed": "Доберман"}
]
print(dogs[2])
print(dogs[2]['breed'])
print(dogs[2]['name'])

# Створи 10 кортежів з довільною інформацією (наприклад, ім’я, вік, місто).

# Наповнити спиок цими кортежами
tup_1 = ("Андрій", 25, "Київ")
tup_2 = ("Олена", 30, "Львів")
tup_3 = ("Ігор", 22, "Харків")
tup_4 = ("Марія", 27, "Одеса")
tup_5 = ("Петро", 35, "Дніпро")
tup_6 = ("Юлія", 28, "Тернопіль")
tup_7 = ("Сергій", 40, "Запоріжжя")
tup_8 = ("Наталя", 24, "Полтава")
tup_9 = ("Віталій", 33, "Черкаси")
tup_0 = ("Інна", 29, "Житомир")

data = [
    ("Андрій", 25, "Київ"),
    ("Олена", 30, "Львів"),
    ("Ігор", 22, "Харків"),
    ("Марія", 27, "Одеса"),
    ("Петро", 35, "Дніпро"),
    ("Юлія", 28, "Тернопіль"),
    ("Сергій", 40, "Запоріжжя"),
    ("Наталя", 24, "Полтава"),
    ("Віталій", 33, "Черкаси"),
    ("Інна", 29, "Житомир")
]

print(data)

data_2 = [
    tup_1,
    tup_2,
    tup_3,
    tup_4,
    tup_5,
    tup_6,
    tup_7,
    tup_8,
    tup_9,
    tup_0
]

print(data_2)

# Створи 5 окремих масивів (списків) у Python.
#
# Об’єднай їх в один список за допомогою оператора * (розпакування списків).

a = [1, 2]
b = [3, 4, 777]
c = [5]
d = [6, 7]
e = [8, 9, 10, 11]

result = [*a, *c, *b, *d, *e]
print(result)
