# Створення та доступ до елементів списку
#
# Створіть список з назвою shopping_list, який містить наступні рядки: "молоко", "хліб", "яйця", "сир".
# Виведіть на екран весь список.
# Виведіть на екран перший елемент списку (той, що має індекс 0)
# .

# 1. Створюємо список
shopping_list = ["молоко", "хліб", "яйця", "сир"]

# 2. Виводимо весь список
print("Мій список покупок:")
print(shopping_list)

# 3. Виводимо перший елемент
print("Перший пункт у списку:")
print(shopping_list[0])



# Створи список із 7 собак.
#
# Кожна собака — словник з трьома полями: "name" (кличка), "age" (вік), "breed" (порода).
#
# Виведи третю собаку зі списку та її кличку.

dogs = [
    {"name": "Рекс", "age": 5, "breed": "Лабрадор"},
    {"name": "Бім", "age": 3, "breed": "Хаскі"},
    {"name": "Тузик", "age": 4, "breed": "Вівчарка"},
    {"name": "Барні", "age": 2, "breed": "Мопс"},
    {"name": "Чарлі", "age": 6, "breed": "Бульдог"},
    {"name": "Лакі", "age": 1, "breed": "Коргі"},
    {"name": "Макс", "age": 7, "breed": "Доберман"}
]

third_dog = dogs[2]
print(third_dog["name"])  # Виведе: Тузик
