# Створи 10 кортежів з довільною інформацією (наприклад, ім’я, вік, місто).
tup_1 = ("Андрій", 25, "Київ")
tup_2 = ("Олена", 30, "Львів")
tup_3 = ("Ігор", 22, "Харків")
tup_4 = ("Марія", 27, "Одеса")
tup_5 = ("Петро", 35, "Дніпро")
tup_6 = ("Юлія", 28, "Тернопіль")
tup_7 = ("Сергій", 40, "Запоріжжя")
tup_8 = ("Наталя", 24, "Полтава")
tup_9 = ("Віталій", 33, "Черкаси")
tup_0 = ("Інна", 29, "Житомир")

#Наповнити спиок цими кортежами
data = [
    ("Андрій", 25, "Київ"),
    ("Олена", 30, "Львів"),
    ("Ігор", 22, "Харків"),
    ("Марія", 27, "Одеса"),
    ("Петро", 35, "Дніпро"),
    ("Юлія", 28, "Тернопіль"),
    ("Сергій", 40, "Запоріжжя"),
    ("Наталя", 24, "Полтава"),
    ("Віталій", 33, "Черкаси"),
    ("Інна", 29, "Житомир")
]

print(data)

