# Форматування даних користувача
# Умова:
# Є рядок " ANDRIY " — це ім’я користувача.
# Зроби ім’я повністю малими літерами
# Прибери пробіли
# Потім переведи його в великі літери
# Виведи результат


print("  ANDRIY  "
      .strip()
      .lower()
      .upper())

# Обробка вхідного рядка з анкети
# Умова:
# Є рядок "olena-19" — це запис з анкети (ім’я та вік).
# Розділи рядок за знаком -
# Створи словник з ключами "name" та "age"
# Виведи словник
data = "olena-19"
parts = data.split("-")
user = dict(name=parts[0], age=parts[1])
print(user)

#  Робота з інформацією про книгу
# Умова:
# Створи словник з даними про книгу: назва, рік, автор.
# Виведи значення ключа "автор" через квадратні дужки
# Виведи значення ключа "рік" через .get()
# Виведи список усіх ключів і всіх значень
book = dict(title="Місто", year=1927, author="Валер’ян Підмогильний")
print(book["author"])
print(book.get("year"))
print(book.values())
print(book.keys())

# Очищення словника профілю
# Умова:
# Створи словник з даними про користувача: ім'я, вік.
# Виведи словник
# Очисти словник за допомогою методу
# Виведи словник знову

profile = dict(name="Олена", age=25)
print(profile)
profile.clear()
print(profile)

# Робота зі списком оцінок
# Умова:
# Є список оцінок: [5, 12, 7, 5, 10, 12]
# Додай нову оцінку "н/а" в кінець
# Видали останній елемент
# Порахуй, скільки разів оцінка 12 зустрічається
# Виведи кількість елементів у списку

grades = [5,
          12, 7, 5, 10, 12]
grades.append("н/а")
print(grades)
grades.pop()
print(grades)
print(grades.count(12))
print(len(grades))

#  Робота з чергою покупців
# Умова:
# Є список: ["Анна", "Богдан", "Катерина", "Анна"]
# Додай нового покупця "Юрій" на початок
# Переверни список
# Відсортуй список
queue = ["Анна", "Богдан", "Катерина", "Анна"]
queue.insert(0, "Юрій")
print(queue)
queue.reverse()
print(queue)
queue.sort()
print(queue)
